
import StoriesLayout from "../StoriesLayout";
import Info from "./Info";

export default function Content() {
  return (<>
    <StoriesLayout info={Info}>
      <p>我曾在東京生活了一年，渾渾噩噩，無所適從。每天最多的活動，大概就是散步了。東京的街頭很乾淨，不少地方樹木繁茂。在樹木深處的寺廟是這座超級城市的一大特色。但比起寺廟，更容易使我留心的，便是街角、街邊擺放的大大小小的地藏菩薩石像，有些日本人稱他做「地藏先生」（おじぞさん）。這些石像們被精心維護著；它們被穿戴上絨帽或者圍巾，台前時常供奉著鮮花，顯得十分可愛。</p>
      
      <figure>
        <img src="https://i.pinimg.com/736x/cc/2e/0a/cc2e0a5704ff141c510f29a8eaa54d7b.jpg" />
        <figcaption>
          東京增上寺（ぞうじょうじ）的地藏菩薩們（由 <a href="https://unsplash.com/photos/red-haired-human-statue-pi4lr7TaB7w">Darren Halstead</a> 提供）
        </figcaption>
      </figure>

      <p>當我與朋友（一位土生土長的東京人）談起整個城市遍佈地藏菩薩的雕像時，他忿忿地說：「日本人在二戰期間做了壞事，因此害怕自己和自己的子孫下地獄。」我確信他說對了一半：如果世上真有地獄，那殺戮者一定會去到那裏。但過分的篤定的口氣也讓我懷疑，對於我的疑問，他其實根本答不上來。當我在圖書館查詢資料時，確實得到的是一種有趣且複雜得多的答案，有關一段交流和繁榮的歷史。</p>

      <figure>
        <img src="https://upload.wikimedia.org/wikipedia/commons/8/8c/Jizo_Rokuharamitsuji_%28Unkei_attrib%29.jpg" />
        <figcaption>木造地藏菩薩坐像，京都六波羅蜜寺</figcaption>
      </figure>
      <p>與釋迦摩尼（Siddhārtha Gautama）所不同的是，地藏（Kṣitigarbha）並非是一位在歷史上有記載的人物。目前，我們所知道的是，他是一位來自印度的神，後來，在漢傳佛教的信仰體系中被發揚光大。在唐朝（618年－907年），同時期為奈良時代（710年–794年），地藏信仰便從中國跨洋過海，抵達了了日本。當時正值佛教在日本傳播的鼎盛時期。以奈良為中心，許多重要的寺廟都在這個世紀中拔地而起，例如東大寺、興福寺、法隆寺等等。同時期，唐朝的佛教達到了一個發展的黃金時代，並深深融入了中國的文化、政治以及藝術，許多敦煌壁畫都是在這個時期創作的。</p>
      <figure>
        <img src="https://upload.wikimedia.org/wikipedia/commons/a/a8/K%E1%B9%A3itigarbha_as_Lord_of_the_Six_Ways_%28Stein_Painting_19%29.jpg" />
        <figcaption>
          敦煌莫高窟的地藏菩薩六道主畫像，現藏於大不列顛博物館
        </figcaption>
      </figure>
      <p>唐朝的繁榮吸引來了一批來自日本的留學僧來唐學習，其中也包括吉備真備（きびのまきび）、空海（くうかい）、最澄（さいちょう）等人。此後的數個世紀中，日本僧人從未停止過向中國的學習。至於對於地藏菩薩參拜，也逐漸成為日本人的佛教信仰中的一個重要的環節。人們通過供奉，向地藏菩薩，祈求兒童平安、旅人平安，以及亡魂的安息。</p>

      <p>同時期，唐代的僧人道宣編纂了著名的《地藏菩薩本願經》，很大程度上推廣了地藏信仰。你或許聽說過：「<strong>地獄不空，誓不成佛；眾生度盡，方證菩提。</strong>」這一驚世駭俗之地藏銘言，便是出自這本書。</p>
      <p>錄入《地藏菩薩本願經》</p>
      <p>我將這本書全文錄入於《中華文化有意思》中。不過必須聲明的是，我並不信仰佛教，而僅僅是由於這本書在內容上的有趣。全書大量採用了對話體的形式，並且以釋迦摩尼與地藏的兩人的對話為主，同時，穿插了其他菩薩、天神、鬼王等人物的參與，氣氛崇高，而不失趣味。</p>
      <figure>
        <img src="https://i.pinimg.com/736x/ac/f0/5b/acf05b1cff38ae13771b447790512ce5.jpg" />
        <figcaption>
          木造地藏菩薩像，鎌倉時代，現藏於大都會藝術博物館
        </figcaption>
      </figure>
      <p>書中，釋迦摩尼與地藏在觀點上有高度的一致性。一方面，釋迦摩尼強調了智慧與道德的力量，另一方面，也告誡說眾生具有墮入惡道的本性。書中的地藏菩薩被表現為慈悲的化身，誓願救度眾生脫離六道輪迴的苦難，尤其是幫助受苦難的亡者。後來，這種深入人心的形象，也讓地藏菩薩在百姓心中有極高的地位。書中有一些犀利的告誡，例如：</p>
      <blockquote>
        <p>爾時地藏菩薩摩訶薩白佛言：世尊，我觀是閻浮眾生，舉心動念，無非是罪。脫獲善利，多退初心。若遇惡緣，念念增益。是等輩人，如履泥塗，負於重石，漸困漸重，足步深邃。若得遇知識，替與減負，或全與負。是知識有大力故，復相扶助，勸令牢腳。若達平地，須省惡路，無再經歷。</p>
        <p>——《地藏菩薩本願經 - 利益存亡品第七》</p>
      </blockquote>
      <p>這段話卻彷彿在我耳邊低語：「沒有智慧與理性，你的心念無非是罪惡的。」同時，也讓我回想起但丁與維吉爾剛穿過嘆息之門時所見的場景：</p>
      <blockquote>
        <p>此等苦命人，<br />
          原為活在世上的那些靈魂，<br />
          不僅為天國所厭棄，連地獄也不容。<br />
          他們既未追隨惡也未行善，<br />
          那可憐的天使群也一樣，<br />
          既不是叛逆者，也不是忠誠。</p>
        <p>——但丁《神曲 - 地獄篇》，傅浩譯本</p>
      </blockquote>
      <p>智慧之人在善惡問題上總有相似的觀點，雖有不同，但卻因能夠直面人性的弱點，而有方向上的重合——這是超越民族與文化的。佛教認為，人生來具有佛性，這是人得以從善的天性，而人同時也具有墮落的天性。這於康德對於道德的看法頗為一致。是的，道德並非教化的產物，而是長期的教育與思考的產物。佛教並不認為「人知道得越少越好」。相反，佛教重視智慧（梵文：prajñā），認為獲得知識並對其有一定的見解才是解脫煩惱、達至覺悟的至關重要。當然，佛教並不認同浮士德式的知識獲取，而是希望人們在認識世界的同時，洞察生命的本質。以上佛教觀點，就與許多藉以佛教之名愚化教徒的「大師」有很大的區別；這也是為什麼在平日，我總是盡可能避免與人談論這些事情，以免遇到的是對宗教具有盲目崇拜的人，而非對於古代先哲抱有好奇和敬佩的人——況且，對於佛教，我知道的確很少。</p>
      <figure>
        <img src="https://upload.wikimedia.org/wikipedia/commons/d/d9/Kshitigarbha_with_the_Ten_Kings_of_Hell._From_Dunhuang._Late_9th_-_early_10th_century_AD%2C_British_Museum.jpg" />
        <figcaption>
          《地獄十王圖》，五代十國，絹本，現藏於大英博物館藏。
        </figcaption>
      </figure>
      <p>當我回想起我那位東京的朋友對於日本人的地藏信仰的看法：他或許真的受到了「地獄不空，誓不成佛」這句過於著名的名言的影響。誠然，地藏身上所表現的是那種超越地獄的慈悲之光，但人們對於地藏的信仰，到底多少來自於心中的恐懼，多少來自於對正義的渴望，這是不得而知的。對此，文獻無法告訴我答案，因為人和人是不同的。而我能做的，最多只能要求自己永遠不會因為恐懼而去行善。</p>

    </StoriesLayout>
  </>)
}