import Layout from "../../Layout";
import EPInfo from "./EPInfo";

export default function Content() {
  return (
    <>
      <Layout ep={EPInfo}>
        <p>
          爾時地藏菩薩摩訶薩白佛言：世尊，我今為未來眾生演利益事，於生死中，得大利益，唯願世尊聽我說之。
        </p>
        <p>
          佛告地藏菩薩：汝今欲興慈悲，救拔一切罪苦六道眾生，演不思議事，今正是時，唯當速說。吾即涅槃，使汝早畢是願，吾亦無憂現在未來一切眾生。
        </p>
        <p>
          地藏菩薩白佛言：世尊，過去無量阿僧祇劫，有佛出世，號無邊身如來。若有男子女人聞是佛名，暫生恭敬，即得超越四十劫生死重罪。何況塑畫形像，供養讚歎，其人獲福無量無邊。
        </p>
        <p>
          又於過去恆河沙劫，有佛出世，號寶性如來。若有男子女人聞是佛名，一彈指頃，發心歸依，是人於無上道永不退轉。
        </p>
        <p>
          又於過去有佛出世，號波頭摩勝如來。若有男子、女人，聞是佛名，歷於耳根，是人當得千返生於六欲天中，何況志心稱念。
        </p>
        <p>
          又於過去，不可說不可說阿僧祇劫，有佛出世，號師子吼如來。若有男子女人聞是佛名，一念歸依，是人得遇無量諸佛摩頂授記。
        </p>
        <p>
          又於過去有佛出世，號拘留孫佛。若有男子女人，聞是佛名，志心瞻禮或復讚歎，是人於賢劫千佛會中，為大梵王，得授上記。
        </p>
        <p>
          又於過去有佛出世，號毘婆尸佛。若有男子女人聞是佛名，永不墮惡道，常生人天，受勝妙樂。
        </p>
        <p>
          又於過去無量無數恆河沙劫，有佛出世，號寶勝如來。若有男子女人聞是佛名，畢竟不墮惡道，常在天上受勝妙樂。
        </p>
        <p>
          又於過去有佛出世，號寶相如來。若有男子女人聞是佛名，生恭敬心，是人不久得阿羅漢果。
        </p>
        <p>
          又於過去無量阿僧祇劫，有佛出世，號袈裟幢如來。若有男子女人聞是佛名者，超一百大劫生死之罪。
        </p>
        <p>
          又於過去有佛出世，號大通山王如來。若有男子女人聞是佛名者，是人得遇恆河沙佛廣為說法，必成菩提。
        </p>
        <p>
          又於過去有淨月佛、山王佛、智勝佛、淨名王佛、智成就佛、無上佛、妙聲佛、滿月佛、月面佛有如是等不可說佛。世尊，現在未來一切眾生，若天若人，若男若女，但念得一佛名號，功德無量，何況多名。
        </p>
        <p>
          是眾生等，生時死時，自得大利，終不墮惡道。若有臨命終人，家中眷屬，乃至一人，為是病人高聲念一佛名，是命終人，除五無間罪，餘業報等悉得銷滅。是五無間罪，雖至極重，動經億劫，了不得出，承斯臨命終時，他人為其稱念佛名，於是罪中，亦漸銷滅。何況眾生自稱自念，獲福無量，滅無量罪。
        </p>
      </Layout>
    </>
  );
}
