
import StoriesLayout from "../StoriesLayout";
import Info from "./Info";

export default function Content() {
  return (
    <>
      <StoriesLayout info={Info}>
        <h2>譯者的話</h2>

        <p>古代中國確實存在與「科學」和「技術」相關的事務，例如</p>

        <ul>
          <li>
            <p>
              天文學和曆法：早在商朝和周朝，中國就有詳細的天文觀測記錄，用於制定農業曆法和預測日食、月食。這些都是基於長期觀察和記錄的系統工作。
            </p>
          </li>
          <li>
            <p>
              醫學：傳統中醫學是古代中國科學的一個重要體現，包括針灸、草藥療法和整體觀的理論，如《黃帝內經》和《本草綱目》。
            </p>
          </li>
          <li>
            <p>
              數學：中國在數學方面也有顯著的成就，比如《九章算術》這部古代數學經典，包含了幾何學、代數和算術的各種問題。
            </p>
          </li>
          <li>
            <p>
              冶金和工藝：中國古代在銅器、鐵器和鋼的製造方面有著卓越的技術，比如宋代的鑄鐵技術和火藥的發明都是科技進步的具體證據。
            </p>
          </li>
          <li>
            <p>
              工程和建築：長城、大運河和都江堰等大型工程項目體現了古代中國在工程學和水利工程方面的高度技術水平。
            </p>
          </li>
          <li>
            <p>
              印刷術和造紙：蔡倫改良的造紙術和後來發展起來的印刷術（如畢昇的活字印刷）是重要技術革新，深刻影響了知識和文化的傳播。
            </p>
          </li>
        </ul>

        <p>
          但在這兩種事務的概念上，卻與我們現代人心中的所想那些有所不同。古代中國並未對這些實踐活動背後的原理進行系統化的理論構建，許多（但不是所有）成果的記錄中缺乏通用理論的闡述——這也是廣為人知的。以至於，在20世紀以前的中國，幾乎可以說，科學家以及工程師這兩種職業是很難獲得上流社會的認可的。而科學與技術之則，而是分攤在了兩種人身上：一是全才式的官員，例如明代的徐光啓、李之藻等人；二是工匠。當然，事情也不能說絕了，畢竟一些鳳毛麟角也是有的，如迷戀數學與機械發明的祖沖之。
        </p>

        <figure>
          <img src="https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/%E7%A5%96%E5%86%B2%E4%B9%8B%E9%93%9C%E5%83%8F.jpg/1363px-%E7%A5%96%E5%86%B2%E4%B9%8B%E9%93%9C%E5%83%8F.jpg" alt="" />

          <figcaption>
            祖沖之在於數學、科學及工程發明上的天才及狂熱是在古代中國極為罕見的。他的成就在此不再贅述。奇怪的是，我無法找到哪怕一幅有關祖沖之的體面的肖像畫。這尊雕像是一件現代作品，水平不高，但色彩尚且樸素。（圖片來源：三獵/維基百科）
          </figcaption>
        </figure>

        <p>
          雖然，科學與技術並沒有在文化上佔據上流人士的「修養」中的主要部分，但是，好奇，這一人的天性，也並未完全抹煞古代中國人對於這些事情的探尋。漢代《九章算術》便是一本有關中國人對於數學的探索的彙編。而李時珍的《本草綱目》也可以說是一本驚人的博物學兼早期醫學的巨著。如果僅僅是出於自上而下的需求，而非出於愛，很難相信這些著作會是我們今天所看到的樣子。
        </p>

        <figure>
          <img src="https://i.pinimg.com/originals/9d/f2/b2/9df2b29e3d6d82dc84d20ffd09b0907a.jpg" alt="" />

          <figcaption>
            《九章算術》的其中一頁。在這一頁中，作者意在介紹一種測量山以及建築物高度的方法，名為「登山望樓」。其中所採用的方法近似今天的三角函數。
          </figcaption>
        </figure>

        <p>
          十九世紀末二十世紀初的中國社會的空氣中夾雜著硝煙、血腥、懊惱，但同時也夾雜著自新與自強。這使得，學者知士們在尋求對外交流的同時，也開始探尋自身文化中那些優秀卻被忽視的部分，例如，科學思想與工程技術。但是，必須指出的是，回顧中國文明之輝煌是一個必要的工作，但這既不是為了給懶惰的人尋找「民族認同感」，也不是為了以「祖宗」之名不加重審地將他們奉為教條，而是為了反思：我們到底錯過了什麼本應當重視而卻被我們忽略的部分？到底是什麼原因使得我們竟然忽視了他們？到底是什麼原因，竟然使得某些科學或技術成果，在時代交替的過程中被遺忘了？到底是什麼竟然使我們違背了天性，視自己的好奇心於不顧，而去追尋外界加之於我們的桎梏？因此，於中國科學技術史的學習和反思，對於中國人而言，是極為重要的。一方面，這是為了塑造更好的社會，另一方面，也是更為重要的是，為了塑造更好的自己——因為社會的優越性乃是個人優越性的一個總和。
        </p>

        <figure>
          <img src="https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Joseph_Needham_in_Cambridge_1965_04.jpg/1468px-Joseph_Needham_in_Cambridge_1965_04.jpg" alt="" />

          <figcaption>
            1965年，在劍橋的辦公室的李約瑟。（圖片來源：Kognos/維基百科）
          </figcaption>
        </figure>

        <p>
          約瑟夫·尼達姆（Joseph
          Needham，1900-1995），即我們所熟知的李約瑟，是一位著名的英國科學史學者、生物化學家和漢學家，以其對中國科學、技術和文明的深入研究而聞名於世。他是劍橋大學的教授，也是皇家學會的成員。
        </p>

        <p>
          1942年，李約瑟在重慶被任命為中英科學合作館館長。當時，正逢抗日戰爭的關鍵時刻；重慶的國民政府正面臨黨內矛盾、國共合作時的摩擦、經濟和財政危機、日本空軍對重慶的持續轟炸等多方面的困境。（這些困難在《中國的科學與文明》中也有所體現。）在這樣的環境下，他對於中國科學史的研究一直持續到了1948年。
        </p>
        <p>
          回到英國後，李約瑟開始撰寫他的巨著《中國的科學與文明》（Science and
          Civilisation in
          China）。而本文所收錄的，是這本書的序言部分。文中，李約瑟強調了一種觀點：研究中國科學與技術的歷史，同時也是為我們提供看待世界的另一個角度。在此，他告誡歐洲學者切勿在自己的文明中故步自封。
        </p>

        <figure>
          <img src="https://i.pinimg.com/originals/25/ce/34/25ce344b6a25f79cf00322059e5285d5.jpg" alt="" />

          <figcaption>
            這是牛津大學版的《中國的科學與文明》中的其中一頁。其中介紹了古代中國天文歷史的書籍，圖文並茂地展示了漢代的日晷和其他天文儀器。其中圖128顯示了一個前漢時期日晷的示意圖，並描述了移動晷針的位置和如何通過它來測量太陽高度和日出方位。下方的文字解釋了這些日晷如何被用於測量和記錄時間，並提到了一些相關的歷史人物和文本。（圖片來源：Second Story Books）</figcaption>
        </figure>

        <p>
          目前，我粗略地對這篇文章進行了一次翻譯。此後，我們會繼續修繕其中的內容，添加更多有助閱讀的信息，例如圖片和有幫助的註釋，並且希望，在未來，工作時間或出版社授權許可的情況下，可以將整本書收錄近《中華文化有意思》。
        </p>

        <h2>《中國科學技術史》序言（李約瑟著）</h2>

        <p>
          現在科學史越來越被廣泛認為是人類文明史中極其重要的一環。在這個過程中，西歐人自然會從現代科學和技術回溯，追蹤科學思想的演變到地中海古代的經驗和成就。有大量的文獻記錄我們可以閱讀到希臘和羅馬思想家、數學家、工程師和自然觀察者所奠定的基礎。較早的作品，如1837年威廉·惠威爾的《歸納科學史》，甚至對其他民族在人類環境理解史上的貢獻的存在都毫無所覺。自那以來，發達的科學思想對埃及人開創性探索和肥沃新月地帶古代居民——蘇美爾人、巴比倫人、赫梯人及其他人的工作的依賴，已被更好地承認和探索。部分由於從麥加斯提尼到馬考萊時代歐洲人與印度文化密切接觸的情況，對印度成就的某些公正評價（雖然仍不充分）已經出現，儘管這裡有嚴重的時間問題，繼續妨礙清晰畫面的呈現。而至今，遠東的貢獻，尤其是其最古老和最核心的文明——中國——在科學、科學思想和技術方面的貢獻，仍未被承認並籠罩在迷霧中。「遠東」這個詞，我在本書中將不再使用，但卻自然而然地出現在紙面上，體現了歐洲人，甚至那些最有意願的人，難以抹去的根本性狹隘視角。亞洲，尤其是「中央之國」中國的科學貢獻，是本書的主題。
        </p>
        <p>
          中國人在不同行的歷史時期中，古代和中世紀，對科學、科學思想和技術的發展到底貢獻了什麼？這個問題在後來的時期依然可以被提出，儘管在17世紀初耶穌會士來到北京之後，中國科學逐漸融入現代科學的普世性。為什麼中國的科學大致上保持在一個持續經驗性的水平，並且限於原始或中世紀類型的理論？如果事實如此，中國人是如何在許多重要的事情上成功地超前，預見著著名的“希臘奇蹟”的科學和技術發現，並跟上擁有古代西方世界全部寶藏的阿拉伯人之步伐，並且在公元3世紀到13世紀之間，保持一個在西方無法匹敵的科學知識水平？怎麼可能中國在理論和幾何系統化方面的弱點沒有阻礙技術發現和發明的出現，這些技術發現和發明在很多時候（我們將不難顯示）遠遠領先於同時代的歐洲，特別是直到15世紀？在16世紀以後發生在歐洲的現代科學興起，成為塑造現代世界秩序的基本因素之一，在中國文明中有哪些阻礙因素阻止了類似興起在亞洲的發生？另一方面，中國社會中有哪些因素比希臘化或中世紀的歐洲社會更有利於科學的早期應用？最後，中國在科學理論上的落後是如何與一種有機的自然哲學的增長共存的，這種自然哲學由不同學派以許多不同形式解釋，但與現代科學在經歷三個世紀的機械唯物主義後被迫接受的自然哲學非常相似？這些是本書試圖探討的一些問題。
        </p>
        <p>
          在普通對話的隨口提及中，可以觀察到相互矛盾的傾向。由17世紀耶穌會士傳遞的古老傳說中的中國年表仍在流傳，導致人們過度歸因於東亞的起源，與此同時，也有強烈的反作用力，不願承認任何重要的發現或發明是在歐洲以外發生的。就在這段文字寫成前的幾天，一位製作關於陶瓷史的紀錄片的製作人來尋求建議，認為拉坯機是中國的發明。然而，這些工具在蘇美爾大約是一千五百年前就已被使用，比黑陶製造者和後來在中國的商朝人使用它們要早得多。同樣，在過去的幾年裡，有關後期物理學、工程學和陶瓷史某些方面的論文，由於傳說材料未被識別為這樣的材料，因此被不公平地忽視了。相反，在1950年出版的一本有趣的技術史著作中，作者沒有給予中國在確實屬於他們的成就上任何功勞，例如最早認識到磁極性、火藥的發現以及最早的生鐵製造。中國科學作家自己也常常忽略了他們祖先的貢獻，例如1952年在北京出版的有關地理植物探礦優秀介紹中，沒有提及這一技術在梁朝（6世紀）初期的起源。因此，本著作的目的是要把所有這些問題從變動的傳聞和“公認意見”的範疇中解脫出來。
        </p>
        <p>
          歐洲學者當然早已模糊地意識到那個廣大而複雜的文明，至少與他們自己的文明一樣錯綜複雜且富饒，位於“心臟地帶”大陸的另一端。在18世紀，它經常被用作歐洲的榜樣，儘管通常理解得非常不完全。使用表意文字而非字母文字的大量人口及其作為最古老的活語言的載體的悠久歷史，這些都得到了充分的認同，但字符的複雜性卻成為理解的一道幾乎無法逾越的障礙。不可避免地，大多數漢學家都具有文學的品味和訓練，雖然世界的進步迫使中國科學家和技術人員成為雙語者，但反過來卻幾乎不成立，以至於每個國家只有屈指可數的幾位歐洲或其他西方自然科學家懂得中文。
        </p>
        <p>
          歷史的奇特變遷使得歐洲自然科學家學習一門東方語言變得非常罕見，看起來既奇怪又有點不恰當。但情況並非一直如此。的確，許多偉大的中世紀翻譯家來自英國群島。根據希蒂（Hitti）的說法，巴斯的阿德拉德在西西里和敘利亞停留，在1126年將阿爾-馬吉里的天文表翻譯成拉丁文，並且通過其許多其他數學和天文翻譯成為一長列英國阿拉伯學家的第一人。其繼承者還包括同一世紀的切斯特的羅伯特以及下一個世紀的阿爾弗雷德·薩雷舍爾和邁克爾·斯科特，他們大多在西班牙工作。當時的情況是，所謂的東方研究是接觸當時最先進科學的唯一途徑，而這種情況已不復存在。現在，我們更是為了整個文明史的研究試圖撥開語言的帷幕。幸運的是，仍然有一些孤立的學者，如E.J.霍米亞德和H.J.J.溫特，繼續維持巴斯的阿德拉德的傳統。至於中國，很少有掌握漢語的人具備科學資格，能夠評價中國的貢獻。在早期，有耶穌會士高比爾神父，終其一生在中國研究天文及其歷史（1722年至1759年）。在上個世紀，有傳教士兼數學家亞歷山大·懷利和航海家利奧波德·德·索舒爾；最近的如馬伯樂，雖然本身是人文主義者，為他的漢學研究深入研究天文。我們之中仍有工程師H.查特利，天文學家W.哈特納等。中國植物學有其布雷特施奈德，中醫學有其胡波特，但他們的工作僅僅是開始，甚至連中國學者自己都未曾全面覆蓋廣泛的科學領域。
        </p>
        <p>
          顯然，從科學家們面對的主題來看，即使是二十位專家各自一生努力研究，僅能開始產生一些成果，因此像現在這樣的一本書只能算是一種初步探查。這本書的意義在於現已存在大量且分散的文獻，並且這些文獻從未被整合進一本書中，依據如上所述的問題框架進行構建。除了這些中西文獻之外，還存在著大量保存完好的原始中文書籍。這樣一部作品的問世至少已遲到半個世紀，這部分是由於需要與學者能夠設想從事這項工作的某些獨特情況。然而，這樣的學者需要：（1）接受過科學訓練，並且多年從事有益且富有成效的科學研究；（2）廣泛瞭解歐洲科學史，並在其中某個方面開展了一些原創工作；（3）對科學技術的社會經濟背景在歐洲歷史的不同階段有興趣並有所了解。另一方面，他還應該：（4）有中國生活的個人體驗，並有機會在那裡廣泛旅行，最好不是作為傳教士、常規外交官或商人；（5）具備中文知識，即使不足以進行快速閱讀，至少足以查閱原始資料和必要的參考書；（6）幸運地得到眾多中國科學家和學者的指導。這些看似不尋常的條件恰好都在我身上集中，這構成了我對即將面臨的批評的基本防禦，這些批評來自各個領域的專家們。這也是我願意捨棄許多事物來完成這項調查的原因，因為擔心在另一個人身上再次湊齊這些條件或許需要相當一段時間。
        </p>
        <p>
          對於任何單單依賴翻譯的人來說，像目前這樣的工作是完全不可能的，不僅因為必要資料中有很大一部分從未被翻譯成任何西方語言，而且因為許多最可靠的漢學家在使用科學和技術術語時非常馬虎，即使他們理解這些術語。通過給出一些具體的例子來強調這一點可能是值得的。
        </p>
        <p>
          在唯一一個完整的《墨子》（墨翟大師之書——戰國時期（公元前–4世紀）關於社會倫理、哲學和邏輯的重要著作）的翻譯中，有關於紡織技術的描述。翻譯為：「婦女從事多彩的刺繡，男子從事嵌花織品的織造。」現在花樓機的發明日期，如我們稍後將要理解的，在技術史上是一個非常重要的問題，如果按字面意思理解這個翻譯，錯誤很容易出現在將其置於公元前–4世紀而非公元前–1世紀。但看一下原文會發現，並未提到織入的圖案；該男子工作的術語是「刻鏤」，字面意思是「切割和雕刻」，無疑代表「刻絲」，意思是將彩色線縫在已經織好的布料上織成的一種錦緞。因此，花樓機無關。
        </p>
        <p>
          再一次，在《論衡》中，這是一部由王充撰寫於約公元83年，具有重要科學意義的作品，其中提到了酒。翻譯如下：「從煮熟的穀物中釀酒。」但文中的術語是「釀」，意思是發酵，不是蒸餾。許多類似的段落也是如此。依賴一位當之無愧的著名漢學家的翻譯，可能會導致一種完全不合理的信念，以為中國人在公元1世紀利用蒸餾技術從酒中製備高酒精含量的酒類。這個錯誤在五十多年前就被
          Dudgeon
          指出，他作為一名醫學專家，雖然不怎麼通曉漢學，但知道發酵和蒸餾的區別。然而，1944年翻譯葛洪4世紀的煉丹著作《抱朴子》的
          Feifel
          犯了同樣的錯誤。而在涉及更廣泛的概念而非實際事務時，翻譯者毫無顧慮地將具有典型西方思想的內容讀入中國文本中，正如我們將在涉及原子、自然法則等方面充分看到的。另外，有許多理由可以支持不翻譯某些中國的技術術語，如「道」，而是在首次出現時盡力加以定義或解釋，然後以音譯形式重複使用。
        </p>
        <p>
          撰寫科學史的方法有很多種。有一種是基礎型—超過某個點後就難以令人滿意，還有軼事型，只在大師的手中才允許，例如
          E. G. Browne 在他的《阿拉伯醫學》中所展現的那樣。書目風格，如 Aldo
          Mieli
          的《阿拉伯科學》中所示範的那樣，儘管無疑是有價值的，但在一個人想要確切知道一個人貢獻了什麼而不是長長的書名列表時，可能會非常令人著急，有些書可能還被錯誤歸給了他。無論是
          George Sarton 獨特的《科學史導言》，還是 J. R. Partington
          的《應用化學的起源與發展》，其全面的方式都因要涵蓋的範圍過於廣泛而被排除在外。《社會》，由
          Lewis Mumford 在《技術與文明》或 J.G. Crowther
          在他的《科學的社會關係》或 Gordon Childe
          的作品中所收錄——都是著名的書籍——只會對調查的一個方面有所幫助。或許
          Brunet 和 Mieli 的《科學史》、Charles Singer
          在草本植物學和光學方面的卓越專著，以及 T. F. Carter
          的《中國印刷術的發明》，最接近我所設定的範式。
        </p>
        <p>
          本書事實上並非針對漢學家，也不是針對廣大的一般公眾，而是針對所有受過良好教育的人，不論他們是否是科學家，只要他們對科學史、科學思想和技術在整體文明史中的關係，以及亞洲和歐洲的比較發展有興趣。因此，它的意圖是在不遺漏任何重要內容的意義上是全面的，但不像學術期刊上的論文或像勞弗的《中伊》那樣詳細研究每一個細節，並在腳註中佔據比正文更多的空間。與像
          C. P.
          費茲傑羅的《中國》或喬治·山森爵士的《日本》這類沒提供證據來源的「高普及」作品不同，這裡肯定會有腳註，但由於我主要是概述要點而非詳細探討，因此我的許多筆記將保持未使用狀態，並且背景材料或確鑿證據將永遠為感興趣的讀者自由查閱。
        </p>
        <p>
          既然如此，中國字符未全部省略這件事可能會讓一些人感到驚訝。我認為完全不使用漢字是不可行的，即使如同這裡所做的那樣，將它們分離到特定的註釋和索引中，原因在於中文中同音字特別多。沒有字形顯示，任何懂中文的讀者都會陷入嚴重的困境，這樣的作品作為研究工具幾乎毫無用處。此外，拼音系統種類繁多，給予無盡的漢學辯論素材，但至今仍無法創造出一種能用字母無誤地再現中文字符多種細微差別的系統。雖然前文中提到本書主要面向的是一般受過教育的公眾，而非漢學家，但這一點並不意味著希望漢學家不會翻閱本書；事實上，我甚至敢相信他們能夠發現一些對他們有用且新穎的科學事項。尤其希望某些年輕一代的中文及其他亞洲語言的學生，能夠擁有或獲得自然科學的訓練和經驗，以便本書能激發他們在這個迷人的邊緣領域進行更深入的研究。因此，如果只給出拼音而沒有漢字，就會產生不可避免的不準確性甚至完全混亂，對他們來說是不可原諒的。而身為中國人的讀者，不論是科學家還是學者，都應該得到這樣的禮遇。
        </p>
        <p>
          對於任何單一作者，即使如我一樣受到一些親密合作者的幫助，在如此廣泛的領域中僅依賴原始資料是完全不可能的。儘管我們已經盡可能依賴這些資料，我們也毫不猶豫地使用所有可獲得的次要來源。事實上，大多數用中文或日文寫成的資料對於西方的科學歷史學家來說，大部分仍完全未知。因此，我感覺如果這本書主要是一本書目，它將會非常有用。但我相信，它會被認為遠不止如此。
        </p>
        <p>
          它是否不可能被視為對國際理解的貢獻呢？中國人的天才本質是否被西方大大誤解了？這種天才的概念，如此普遍，又常常被中國文人鼓勵試圖向西方觀眾闡述，被認為主要是農業和藝術的質量，完全忽略了在基督教歷元的最初十三個世紀期間，西方從中國接納的那一長串技術發現，往往完全不知道它們的來源。例如，忘記化學中所有最重要的根源之一，如果不是最重要的單一根源，通常是中國的。但增加例子是預測接下來的內容。
        </p>
        <p>
          有些人可能會僅僅根據過去的科技和科學對於17世紀歐洲現代科學發源的直接遺傳繼承性來判斷它們的價值。中國的發現與發明在多大程度上實際上促進了這一過程，還有待研究。然而，即使最終發現它們大部分並未如此，那就能成為貶低它們研究價值的任何多一分的理由嗎？不管是好是壞，現在已成定局，世界是一體的。世界公民必須與他的同胞們生活在愈來愈狹窄的飛機和無線電波覆蓋範圍之內。他只有在了解自己以及他們的文化先賢和前輩的成就的情況下，才能給予他們應得的理解和欣賞。我們正生活在一個新的普世主義的黎明中，即使人類能在不負責任者控制的難以想像的能量來源所帶來的危險中倖存下來，這將把所有種族間的勞動人民團結成一個既具有普世性又富有合作精神的社區。這座建築的砂漿是相互理解，實際上，目前的工作是以蘭斯洛特·安德魯斯的統一精神進行的，他的17世紀傳記作者曾說他「在東方語言方面無可匹敵」，「許多人認為如果他當時在世的話，完全可以成為語言混亂時的總翻譯官」。
        </p>
        <p>
          今天，儘管「白人」可能已經放下了他的「重擔」，甚至忘記了它，歐洲人看到現代科學和技術對居住地球的完全改造，不會經常試圖對自己說，畢竟這一切始於歐洲的伽利略和維薩里，並總結出智慧是從我們這裡誕生的嗎？有必要對這種觀點進行健康的修正。中國對人類理解自然及其控制自然做出了貢獻，而且這是偉大的貢獻。或許伽利略和維薩里等人是歐洲人的這一事實根本不取決於歐洲人民的任何內在優越性，而是依賴於環境因素，這些因素在其他擁有不同地理環境和社會演變的文明中沒有也無法運作。無論如何，這個問題值得調查。可以肯定的是，沒有任何民族或民族群體在科學發展的貢獻上擁有壟斷地位。他們的成就應該相互承認，並以普世兄弟情誼之手自由地慶祝。
        </p>
      </StoriesLayout>
    </>
  );
}
