import StoriesLayout from "../StoriesLayout";
import Info from "./Info";

export default function Content() {
  return (<>
    <StoriesLayout info={Info}>
      <p>
      發展永遠不是故步自封。中華文化每次的繁榮必定伴隨著思想的自由以及對外交流，如唐代「撒爾馬漢的金桃」、民國的政治及思想革新、新中國80年代的改革開放，也亦如本文所要敘述的晚明期間，中國與西方世界的交流。中華大地，最不缺的便是解放將該片土地上的人們的思想作為己任的先驅者，誓如康有為、梁啟超、嚴復、孫中山、蔡元培、魯迅、陳獨秀、胡適等，當然，也包括林風眠、劉海粟、常玉、潘玉良、朱德群等藝術家；同時，也包括那些仍在孤獨中探尋理想世界年輕一代藝術家、學者和工程師們。本文中，所主要提到的是兩位明朝先驅者：徐光啓與利瑪竇。每當回看上述先驅者的努力，心弦被扣動之際，也黯然自卑，為自己無可救藥、怯懦的犬儒及享樂主義而懺悔。他們的成就是任何帝王「功績」所無法比擬的。
      </p>

      <p>
      不過，為了能讓你們更好地看到這段我胡亂軿湊之歷史的背景，我不得不首先敘述一段黑暗的過往，並請原諒我的無知，無能力去詳述那些衝破這片黑幕的先驅者的事蹟。
      </p>

      <p>
      ——作者按
      </p>

      <h2>
      海禁
      </h2>

      <p>
      明朝政府從統治初期便頒布了嚴格的海禁政策，有道是「片舟不得下海」；說更具體一些的話，便是：
      </p>

      <blockquote>
        <p>片板不許下海，艨艟巨艦反蔽江而來，寸貨不許下番，子女玉帛恆滿載而去。</p>

        <p>——谢杰《虔台倭纂》</p>
      </blockquote>

      <figure>
        <img src="https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/%E6%98%8E%E5%A4%AA%E7%A5%96%E7%94%BB%E5%83%8F.jpg/802px-%E6%98%8E%E5%A4%AA%E7%A5%96%E7%94%BB%E5%83%8F.jpg" alt="" />

        <figcaption>
          在海禁一事主要由朱元璋在位期間的朝廷頒布，其中原因複雜。但對於「安全」和「經濟」是其考慮的兩個主要因素之一。值得一提的是其經濟緣由。朱元璋認為：集中控制對外貿易可以有效控制國家財政收入以及資金流向。
        </figcaption>
      </figure>
    </StoriesLayout>
  </>)
}